{
  "nodes": [
    {
      "op": "null", 
      "param": {}, 
      "name": "data", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm1_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm1", 
      "inputs": [[0, 0], [1, 0], [2, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Reshape", 
      "param": {
        "keep_highest": "False", 
        "shape": "(-1,9216)", 
        "target_shape": "(0,0)"
      }, 
      "name": "reshape1", 
      "inputs": [[3, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fullyconnected3_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fullyconnected3_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "200"
      }, 
      "name": "fullyconnected3", 
      "inputs": [[4, 0], [5, 0], [6, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation2", 
      "inputs": [[7, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fullyconnected4_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fullyconnected4_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "200"
      }, 
      "name": "fullyconnected4", 
      "inputs": [[8, 0], [9, 0], [10, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation3", 
      "inputs": [[11, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fullyconnected5_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fullyconnected5_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "30"
      }, 
      "name": "fullyconnected5", 
      "inputs": [[12, 0], [13, 0], [14, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "output_label", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "LinearRegressionOutput", 
      "param": {"grad_scale": "1"}, 
      "name": "output", 
      "inputs": [[15, 0], [16, 0]], 
      "backward_source_id": -1
    }
  ], 
  "arg_nodes": [0, 1, 2, 5, 6, 9, 10, 13, 14, 16], 
  "heads": [[17, 0]]
}